chy = {"甲子" : 1, "乙丑" : 2, "丙寅" : 3, "丁卯" : 4, "戊辰" : 5, "己巳" : 6, "庚午" : 7, "辛未" : 8, "壬申" : 9, "癸酉" : 10, "甲戌" : 11, "乙亥" : 12, "丙子" : 13, "丁丑" : 14, "戊寅" : 15, "己卯" : 16, "庚辰" : 17, "辛巳" : 18, "壬午" : 19, "癸未" : 20,"甲申" : 21, "乙酉" : 22, "丙戌" : 23, "丁亥" : 24, "戊子" : 25, "己丑" : 26, "庚寅" : 27, "辛卯" : 28, "壬辰" : 29, "癸巳" : 30, "甲午" : 31, "乙未" : 32, "丙申" : 33, "丁酉" : 34, "戊戌" : 35, "己亥" : 36, "庚子" : 37, "辛丑" : 38, "壬寅" : 39, "癸卯" : 40, "甲辰" : 41, "乙巳" : 42, "丙午" : 43, "丁未" : 44, "戊申" : 45, "己酉" : 46, "庚戌" : 47, "辛亥" : 48, "壬子" : 49, "癸丑" : 50, "甲寅" : 51, "乙卯" : 52, "丙辰" : 53, "丁巳" : 54, "戊午" : 55, "己未" : 56, "庚申" : 57, "辛酉" : 58, "壬戌" : 59, "癸亥" : 0 }
cst = ['쥐','소', '호랑이', '토끼', '용', '뱀', '말', '양', '원숭이', '닭', '개','돼지']
def gw(gj,sty):
    if sty > 0:
        sy = chy[gj]+3
        x = (sty // 60)
        ry = (x*60)+sy
        print('천간에서 변환된 서력년도 입니다.\n', ry)
        ly = (chy[gj] % 12)-1
        print('이 해는 '+str((cst[ly]))+'띠 입니다.\n')
    elif sty < 0:
        sy = chy[gj]+2
        x = (sty // 60)
        ry = (x*60)+sy
        print('천간에서 변환된 서력년도 입니다.\n', ry)
        ly = (chy[gj] % 12)-1
        print('이 해는 '+str((cst[ly]))+'띠 입니다.\n')
    else:
        print('잘못된 입력값입니다.\n')
