def wl(n):
    rmy = {1 : "甲子", 2 : "乙丑", 3 : "丙寅",4 : "丁卯", 5 : "戊辰", 6 : "己巳", 7 : "庚午", 8 : "辛未", 9 : "壬申", 10 : "癸酉", 11 : "甲戌", 12 : "乙亥", 13 : "丙子", 14 : "丁丑", 15 : "戊寅", 16 : "己卯", 17 : "庚辰", 18 : "辛巳", 19 : "壬午", 20 : "癸未", 21 : "甲申", 22 : "乙酉", 23 : "丙戌", 24 : "丁亥", 25 : "戊子", 26 : "己丑", 27 : "庚寅", 28 : "辛卯", 29 : "壬辰", 30 : "癸巳", 31 : "甲午", 32 : "乙未", 33 : "丙申", 34 : "丁酉", 35 : "戊戌", 36 : "己亥", 37 : "庚子", 38 : "辛丑", 39 : "壬寅", 40 : "癸卯", 41 : "甲辰", 42 : "乙巳", 43 : "丙午", 44 : "丁未", 45 : "戊申", 46 : "己酉", 47 : "庚戌", 48 : "辛亥", 49 : "壬子", 50 : "癸丑", 51 : "甲寅", 52 : "乙卯", 53 : "丙辰", 54 : "丁巳", 55 : "戊午", 56 : "己未", 57 : "庚申", 58 : "辛酉", 59 : "壬戌", 0 : "癸亥"}
    cst = ['쥐','소', '호랑이', '토끼', '용', '뱀', '말', '양', '원숭이', '닭', '개','돼지']
    if n > 0:
        gj = (n-3) % 60
        print('서력에서 변환된 천간은 '+str(rmy[gj])+'년 입니다.\n')
        cs = (gj % 12)-1
        print('이 해는 '+str(cst[cs])+'띠 입니다.')
    elif n < 0:
        gj = (n-2) % 60
        print('서력에서 변환된 천간은 '+str(rmy[gj])+'년 입니다.\n')
        cs = (gj % 12)-1
        print('이 해는 '+str(cst[cs])+'띠 입니다.')
    else:
        print('잘못된 값을 입력했습니다.')
